---
kind: method
id: M:Autodesk.Revit.DB.TextRange.#ctor(Autodesk.Revit.DB.TextRange)
source: html/a43af5a1-7b1d-f9a0-da1b-37f176e65bd9.htm
---
# Autodesk.Revit.DB.TextRange.#ctor Method

Constructs a copy of the input TextRange object.

## Syntax (C#)
```csharp
public TextRange(
	TextRange other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.TextRange`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null